Tekla Open API Reference for Tekla Structures 2025
InputItem Methods
The InputItem type exposes the following members.
Methods
Name | Description
GetData
 Returns the data of the input item. See also: InputItem.InputTypeEnum.
GetInputType
 Returns the type of the input item.
Top
See Also
Reference
InputItem Class
Tekla.Structures.Model Namespace